[
  {
    "id": "C1",
    "name": "Org-Level Thinking",
    "slug": "org-level-thinking",
    "domain": "Strategy",
    "description": "Assessed by: org topology clarity, cross-team ownership single-threading, re-org execution velocity, coordination overhead ratios, and strategic alignment metrics. Absence causes: ambiguous ownership creating coordination tax, re-orgs that destroy trust and attrition, scaling bottlenecks, and misalignment between org structure and architecture.",
    "primarySubTopics": [
      "16"
    ],
    "observableCount": 16,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C2",
    "name": "Strategic Prioritization",
    "slug": "strategic-prioritization",
    "domain": "Strategy",
    "description": "Assessed by: planning artifact quality, roadmap delivery rate, stakeholder alignment metrics, resource allocation transparency, and business ROI articulation. Absence causes: engineering work invisible to business, strategic misalignment, resource thrashing between competing priorities, and wasted engineering capacity.",
    "primarySubTopics": [
      "4"
    ],
    "observableCount": 6,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C3",
    "name": "Systems Design & Architecture",
    "slug": "systems-design-architecture",
    "domain": "Execution",
    "description": "Assessed by: architecture decision records, design review process, SLO framework, tech debt registry, and migration execution. Absence causes: conflicting architectural decisions, compounding tech debt, reactive reliability investment, and failed migrations.",
    "primarySubTopics": [
      "11"
    ],
    "observableCount": 11,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C4",
    "name": "Operational Leadership & Rhythm",
    "slug": "operational-leadership-rhythm",
    "domain": "Execution",
    "description": "Assessed by: sprint commitment accuracy, delivery cadence consistency, toil reduction metrics, and developer focus time. Absence causes: unpredictable delivery, eroded stakeholder trust, meeting overhead displacing deep work, and compounding operational toil.",
    "primarySubTopics": [
      "13"
    ],
    "observableCount": 13,
    "v5Status": "CARRIED",
    "enabledBy": [
      "C9"
    ]
  },
  {
    "id": "C5",
    "name": "Cross-Functional Influence",
    "slug": "cross-functional-influence",
    "domain": "Stakeholder",
    "description": "Assessed by: cross-functional stakeholder satisfaction, influence on major decisions, stakeholder escalation reduction, and peer feedback credibility. Absence causes: misaligned initiatives, cross-functional blame games, delayed delivery from lack of coordination, and EM isolation from product/design leadership.",
    "primarySubTopics": [
      "16"
    ],
    "observableCount": 16,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C6",
    "name": "Coaching & Talent Development",
    "slug": "coaching-talent-development",
    "domain": "People",
    "description": "Assessed by: skip-level conversation quality, performance review calibration rigor, promotion success rate, retention of high performers, and team growth velocity. Absence causes: high-potential talent leaves for development, performance reviews become recency-biased, weak managers go uncoached, and promotions feel arbitrary rather than earned.",
    "primarySubTopics": [
      "12"
    ],
    "observableCount": 13,
    "v5Status": "UPDATED",
    "enabledBy": [
      "C7"
    ]
  },
  {
    "id": "C7",
    "name": "Decision Framing & Communication",
    "slug": "decision-framing-communication",
    "domain": "Stakeholder",
    "description": "Assessed by: decision memo quality and approval rates, exec presentation crisp communication, proactive status updates, bad news flag timing, roadmap transparency, and DACI/RFC adoption. Absence causes: decisions revisited endlessly, stakeholder misalignment, late problem escalation, poor exec perception, and wasted organizational energy on rework.",
    "primarySubTopics": [
      "11"
    ],
    "observableCount": 11,
    "v5Status": "CARRIED",
    "enabledBy": [
      "C3"
    ]
  },
  {
    "id": "C8",
    "name": "Incidents, Risk & Reliability",
    "slug": "incidents-risk-reliability",
    "domain": "Reliability",
    "description": "Assessed by: incident MTTR, post-mortem action completion rate, on-call page volume, game day frequency, and error budget burn rate. Absence causes: prolonged outages, repeat incidents from unaddressed root causes, on-call burnout, and unmanaged operational risk.",
    "primarySubTopics": [
      "6"
    ],
    "observableCount": 8,
    "v5Status": "UPDATED",
    "enabledBy": [
      "C3"
    ]
  },
  {
    "id": "C9",
    "name": "Metrics, Measurement & Outcomes",
    "slug": "metrics-measurement-outcomes",
    "domain": "Data",
    "description": "Assessed by: DORA metric tracking, developer satisfaction measurement, OKR scoring discipline, business metric translation, and metric pairing against gaming. Absence causes: invisible delivery problems, unmeasured developer friction, vague OKRs that don't drive behavior, and engineering investment invisible to business leadership.",
    "primarySubTopics": [
      "9"
    ],
    "observableCount": 10,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C10",
    "name": "Resource Allocation & Tradeoffs",
    "slug": "resource-allocation-tradeoffs",
    "domain": "Strategy",
    "description": "Assessed by: headcount proposal success rate, budget utilization vs plan, engineering investment mix (feature/reliability/debt), capacity reallocation speed, and cost-per-engineer-month visibility. Absence causes: resource hoarding across teams, underfunded critical initiatives, headcount misaligned with strategy, invisible engineering costs, and chronic team capacity imbalances.",
    "primarySubTopics": [
      "8"
    ],
    "observableCount": 8,
    "v5Status": "CARRIED",
    "enabledBy": [
      "C9"
    ]
  },
  {
    "id": "C11",
    "name": "Hiring, Onboarding & Role Design",
    "slug": "hiring-onboarding-role-design",
    "domain": "People",
    "description": "Assessed by: interview scorecard calibration, offer acceptance rate, time-to-productivity for new hires, job description signal quality, and pipeline diversity metrics. Absence causes: long time-to-fill creating delivery gaps, inconsistent hiring bar, talent brand damage from poor candidate experience, slow new-hire ramp eroding team velocity, and role confusion from vague job descriptions.",
    "primarySubTopics": [
      "10"
    ],
    "observableCount": 11,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C12",
    "name": "Culture & Norms Shaping",
    "slug": "culture-norms-shaping",
    "domain": "People",
    "description": "Assessed by: psychological safety survey scores, team conflict resolution patterns, norm reinforcement consistency, inclusion metrics, and skip-level sentiment. Absence causes: toxic behavior tolerated from high performers, psychological safety collapse during crises, cultural drift as team scales, and 'missing stair' patterns where everyone routes around known problems.",
    "primarySubTopics": [
      "8"
    ],
    "observableCount": 8,
    "v5Status": "CARRIED",
    "enabledBy": []
  },
  {
    "id": "C13",
    "name": "Security & Compliance Posture",
    "slug": "security-compliance-posture",
    "domain": "Reliability",
    "description": "Assessed by: vulnerability remediation SLAs, security review coverage in design phase, compliance audit findings, incident response readiness, and team security training completion. Absence causes: security incidents from unpatched vulnerabilities, compliance failures creating legal risk, security treated as afterthought in design, and reactive firefighting replacing proactive governance.",
    "primarySubTopics": [
      "4"
    ],
    "observableCount": 7,
    "v5Status": "NEW",
    "enabledBy": [
      "C3"
    ]
  },
  {
    "id": "C14",
    "name": "Performance Management & Calibration",
    "slug": "performance-management-calibration",
    "domain": "People",
    "description": "Assessed by: performance review completion timeliness, calibration committee rating distributions, PIP conversion rates, feedback delivery cadence, and promotion evidence quality. Absence causes: performance surprises at review time, calibration without behavioral evidence, PIPs used punitively rather than developmentally, high performers under-recognized, and low performers carried indefinitely.",
    "primarySubTopics": [
      "9"
    ],
    "observableCount": 9,
    "v5Status": "NEW",
    "enabledBy": [
      "C6"
    ]
  }
]
