[
  {
    "id": "P-C6-1",
    "slug": "your-top-performer-gives-2-weeks-notice",
    "observableIds": [
      "C6-O3",
      "C6-O4"
    ],
    "capabilityIds": [
      "C6"
    ],
    "title": "Your Top Performer Gives 2 Weeks Notice",
    "context": "Your best senior engineer has an offer from a competitor. They seem decided but are giving you a courtesy conversation.",
    "topicsActivated": [
      "Team Health (Retention), Performance (Managing High Performers), Stakeholder Mgmt (Delivering Bad News)"
    ],
    "decisionFramework": "1. Listen: understand root cause (comp? growth? culture? manager?). 2. Assess: is this fixable? Be honest with yourself. 3. If fixable: make specific, genuine offer (not panicked counter). 4. If not fixable: wish them well, plan transition. 5. Inform your manager immediately. 6. Plan knowledge transfer. 7. Communicate to team. 8. Post-mortem: what could you have done differently?",
    "commonMistakes": "Panicked counter-offer that doesn't address root cause (buys 6 months at best). Guilt-tripping. Not telling your manager immediately. Not planning knowledge transfer. Ignoring the signal for the rest of the team.",
    "whatGoodLooksLike": "Root cause conversation within 24hrs. Honest assessment of fixability. If counter-offering: specific, addresses root cause, approved by leadership. If not: graceful exit with knowledge transfer plan. Team comms within 48hrs. Retrospective on retention practices.",
    "mappingNotes": "Top performer retention scenario"
  },
  {
    "id": "P-C8-1",
    "slug": "major-production-incident-during-your-vacation",
    "observableIds": [
      "C8-O1",
      "C8-O2",
      "C8-O4"
    ],
    "capabilityIds": [
      "C8"
    ],
    "title": "Major Production Incident During Your Vacation",
    "context": "You're on vacation. A Sev1 incident fires and your team is handling it. Your manager pings you asking for status.",
    "topicsActivated": [
      "Operational Risk (Incident Response), Team Health (Trust), Stakeholder Mgmt (Managing Up)"
    ],
    "decisionFramework": "1. Check: is the team handling it? If yes, trust them. 2. If team is struggling: provide guidance, don't take over. 3. Respond to manager with what you know. 4. Post-vacation: review incident response. 5. If team handled it well: celebrate. If not: identify gaps for training/process/runbooks.",
    "commonMistakes": "Taking over incident from vacation (undermines team, proves you haven't delegated). Going completely dark when your manager needs a response. Blaming team for not handling it perfectly. Using it as evidence that you can't take vacation.",
    "whatGoodLooksLike": "Team handles it using documented processes. You provide brief guidance if asked, but don't run the incident. Post-vacation retro focuses on process improvement, not blame. Your team proved they can function without you — that's a WIN.",
    "mappingNotes": "Production incident during vacation"
  },
  {
    "id": "P-C5-1",
    "slug": "pm-wants-to-ship-a-feature-you-know-will-create-tech-debt",
    "observableIds": [
      "C5-O1",
      "C3-O4"
    ],
    "capabilityIds": [
      "C5",
      "C3"
    ],
    "title": "PM Wants to Ship a Feature You Know Will Create Tech Debt",
    "context": "PM has committed to a deadline with stakeholders. Meeting the deadline requires cutting corners that will cost the team months of debt later.",
    "topicsActivated": [
      "Cross-Functional Partnership (PM Disagreement), Decision Making (Trade-offs), Strategic Alignment (Trade-off Communication)"
    ],
    "decisionFramework": "1. Quantify the debt: specifically what gets cut, what's the future cost (hours, risk, incidents). 2. Present options: (A) Ship on time with known debt + remediation plan, (B) Extend deadline by X to do it right, (C) Reduce scope to hit deadline without debt. 3. Make trade-off PM's decision with full information. 4. If PM chooses debt: document the plan to pay it back. 5. Never: passive-aggressively build it 'right' and miss deadline.",
    "commonMistakes": "Just saying 'no' without alternatives. Passive compliance then complaining about tech debt later. Building it your way and missing the deadline. Not quantifying the actual cost of debt. Escalating without first trying to align directly with PM.",
    "whatGoodLooksLike": "You present 3 clear options with honest trade-offs. PM makes an informed decision. If debt is accepted: remediation plan is written, capacity allocated, and PM agrees to the payback timeline. No resentment — it was a joint decision with eyes open.",
    "mappingNotes": "PM tech debt conflict"
  },
  {
    "id": "P-C12-1",
    "slug": "two-of-your-engineers-are-in-conflict",
    "observableIds": [
      "C12-O1",
      "C12-O2"
    ],
    "capabilityIds": [
      "C12"
    ],
    "title": "Two of Your Engineers Are in Conflict",
    "context": "Two senior engineers disagree on a technical approach. It's gotten personal — code reviews are hostile, standup is tense, team morale is affected.",
    "topicsActivated": [
      "Team Health (Constructive Conflict, Psych Safety), Performance (Feedback), Engineering Culture (Inclusive Environment)"
    ],
    "decisionFramework": "1. Talk to each privately: understand their perspective and concerns. 2. Separate the technical from the personal. 3. Resolve the technical disagreement: use RFC process, get external reviewer, make a decision. 4. Address the personal: specific feedback to each on behavior (not opinions). 5. Mediated conversation if needed. 6. Clear expectations going forward. 7. Follow up in 2 weeks.",
    "commonMistakes": "Ignoring it ('they'll work it out'). Taking sides publicly. Making it about who's right technically while ignoring interpersonal damage. Punishing both equally. Moving one to another team without addressing the root cause.",
    "whatGoodLooksLike": "Technical decision made through structured process (not by who argues louder). Both engineers receive specific, private feedback on behavior. Both acknowledge the impact on the team. Clear working agreement going forward. Follow-up confirms improvement. Team morale recovers.",
    "mappingNotes": "Engineer conflict resolution"
  },
  {
    "id": "P-C1-1",
    "slug": "you-inherit-a-low-performing-team",
    "observableIds": [
      "C1-O8",
      "C1-O7",
      "C6-O2"
    ],
    "capabilityIds": [
      "C1",
      "C6"
    ],
    "title": "You Inherit a Low-Performing Team",
    "context": "You join as EM. In your first month you discover: 2 engineers should probably be on a PIP, the team's metrics are worst in the org, morale is low, and the previous EM left because of burnout.",
    "topicsActivated": [
      "First 90 Days (Assessment, Credibility), Performance (Underperformance, PIPs), Team Health (Psych Safety), Stakeholder Mgmt (Managing Up)"
    ],
    "decisionFramework": "1. Month 1: Listen and assess. Build trust. Understand WHY performance is low (people? process? scope? leadership?). 2. Month 2: Quick wins (fix one obvious pain point). Start 1:1 cadence. Begin addressing most critical performance gap. 3. Month 3: Comprehensive plan to leadership — honest assessment + proposed path. Begin formal performance processes where needed. 4. Communicate to team: 'here's what I've observed, here's what we're going to change, here's how I'll support you.'",
    "commonMistakes": "Making changes in week 1 before understanding context. Putting people on PIP immediately (you weren't there, you don't have evidence yet). Blaming previous EM publicly. Promising everything will be better without a plan. Sugar-coating the situation to leadership.",
    "whatGoodLooksLike": "Honest assessment to leadership at 30 days (with plan, not just problems). Trust built through listening and quick wins. Performance conversations started with clear expectations and genuine support. Team feels heard and sees a path forward. Measurable improvement at 90 days.",
    "mappingNotes": "Inherit low-performing team"
  },
  {
    "id": "P-C1-2",
    "slug": "layoffs-are-coming-and-you-know-before-your-team",
    "observableIds": [
      "C1-O4",
      "C7-O3"
    ],
    "capabilityIds": [
      "C1",
      "C7"
    ],
    "title": "Layoffs Are Coming and You Know Before Your Team",
    "context": "Your Director told you confidentially: 20% RIF next week. You know who's affected on your team. You can't tell anyone yet.",
    "topicsActivated": [
      "Team Health (Leading Through Layoffs), Stakeholder Mgmt (Managing Up), Engineering Culture (Trust)"
    ],
    "decisionFramework": "1. Prepare: talking points for affected and remaining team members. 2. Coordinate: logistics (access revocation, equipment, benefits information). 3. Day of: tell affected people first, in private, with humanity. 4. Same day: address remaining team honestly. 5. Following weeks: over-communicate stability, re-plan roadmap, address survivor guilt. 6. Don't pretend nothing happened.",
    "commonMistakes": "Leaking the news early. Being cold or scripted with affected people. Not being available for remaining team. Immediately jumping to 'let's focus on the work' without acknowledging grief. Not re-planning the roadmap (pretending you can do the same work with fewer people).",
    "whatGoodLooksLike": "Affected people treated with dignity and respect — they remember how they were treated. Remaining team hears honesty: what happened, what's changing, what's not. Roadmap re-planned publicly (team sees you're realistic). 1:1s with every remaining team member within 1 week. Zero additional voluntary attrition in following quarter.",
    "mappingNotes": "Layoffs incoming — pre-disclosure"
  },
  {
    "id": "P-C5-2",
    "slug": "your-new-vp-wants-to-change-everything",
    "observableIds": [
      "C5-O10",
      "C1-O4"
    ],
    "capabilityIds": [
      "C5",
      "C1"
    ],
    "title": "Your New VP Wants to Change Everything",
    "context": "New VP joins. They want to re-org, change tech stack, adopt new processes, and reset all roadmaps. Your team is anxious.",
    "topicsActivated": [
      "Team Health (New Leadership, Managing Through Adversity), Stakeholder Mgmt (Managing Up), Strategic Alignment (Planning)"
    ],
    "decisionFramework": "1. Listen to VP's vision — understand the intent behind changes. 2. Identify: which changes are reasonable? Which are destructive? 3. Push back constructively on changes that would hurt (with data). 4. Shield team from unnecessary churn while supporting legitimate changes. 5. Communicate to team: what's changing, what's not, what you're advocating for. 6. Build trust with new VP through early results.",
    "commonMistakes": "Immediately complying with everything (your team suffers). Immediately resisting everything (you get replaced). Badmouthing the VP to your team. Letting team anxiety fester without addressing it. Not adapting at all to new leadership's style.",
    "whatGoodLooksLike": "You earn VP's trust by delivering results on their priorities. You protect your team from unnecessary churn. Changes that happen are well-communicated and well-executed. Team sees you as their advocate who also adapts to new reality. Six months later: VP trusts you, team trusts you, things are stable.",
    "mappingNotes": "New VP changes everything"
  },
  {
    "id": "P-C6-2",
    "slug": "you-discover-a-senior-engineer-is-quietly-job-searching",
    "observableIds": [
      "C6-O3",
      "C6-O4"
    ],
    "capabilityIds": [
      "C6"
    ],
    "title": "You Discover a Senior Engineer Is Quietly Job Searching",
    "context": "Through the grapevine (or obvious calendar gaps), you realize one of your senior engineers is interviewing elsewhere. They haven't told you.",
    "topicsActivated": [
      "Team Health (Flight Risk, Stay Interviews), Performance (Managing High Performers, Career Conversations)"
    ],
    "decisionFramework": "1. Don't confront them about job searching (it's their right). 2. Create opportunity for honest career conversation: 'How are you feeling about your growth here? What would make the next year exciting for you?' 3. Listen for the underlying need. 4. If you can address it: propose specific changes (scope, comp, growth path). 5. If you can't: be honest about constraints. 6. Either way: plan for potential departure (knowledge transfer, succession).",
    "commonMistakes": "Confronting them directly about interviewing (violation of trust). Panic counter-offer out of nowhere. Ignoring the signals hoping they'll stay. Punishing them with reduced access or scope. Telling their teammates.",
    "whatGoodLooksLike": "Proactive career conversation that feels natural, not surveillance-triggered. You address underlying needs (if possible) before an offer forces your hand. If they stay: because root cause was addressed. If they leave: you had time to plan. Either way: trust preserved.",
    "mappingNotes": "Senior engineer quietly job searching"
  },
  {
    "id": "P-C3-1",
    "slug": "your-team-needs-to-deliver-a-critical-migration-under-tight-deadline",
    "observableIds": [
      "C3-O6",
      "C4-O2"
    ],
    "capabilityIds": [
      "C3",
      "C4"
    ],
    "title": "Your Team Needs to Deliver a Critical Migration Under Tight Deadline",
    "context": "Leadership committed to migrating off a legacy system in Q3. Your team owns it. The deadline is real (vendor contract expiration). Scope is larger than estimated.",
    "topicsActivated": [
      "Technical Strategy (Migration Strategy), Engineering Excellence (Delivery Practices), Stakeholder Mgmt (Trade-off Communication, Delivering Bad News), Team Health (Capacity Planning)"
    ],
    "decisionFramework": "1. Re-estimate honestly: what's actually required? What's the gap vs. plan? 2. Present options: (A) Full migration by deadline with X% overtime risk, (B) Phased migration — critical paths by deadline, remaining by Q4, (C) Full migration with additional resources. 3. Communicate gap EARLY — don't wait until deadline is missed. 4. If proceeding under pressure: protect team health (no sustained overtime), cut scope aggressively, track weekly.",
    "commonMistakes": "Hiding the gap ('we'll figure it out'). Asking team to work overtime for months. Promising delivery you know isn't realistic. Not flagging the risk until it's a crisis. Blaming the estimate instead of managing the situation.",
    "whatGoodLooksLike": "Risk flagged at earliest moment with clear options. Leadership makes informed trade-off decision. Team executes with realistic scope and sustainable pace. Weekly progress visible to stakeholders. If phased: phase 1 delivered on deadline, clear plan for phase 2. Team emerges without burnout.",
    "mappingNotes": "Critical migration under deadline"
  },
  {
    "id": "P-C14-1",
    "slug": "calibration-committee-wants-to-downgrade-your-engineers-rating",
    "observableIds": [
      "C14-O2",
      "C14-O3"
    ],
    "capabilityIds": [
      "C14"
    ],
    "title": "Calibration Committee Wants to Downgrade Your Engineer's Rating",
    "context": "You submitted 'Exceeds Expectations' for a strong senior engineer. In calibration, peer managers are pushing for 'Meets' based on cross-team comparison. You disagree.",
    "topicsActivated": [
      "Performance (Calibration Preparation, Ratings Distribution), Stakeholder Mgmt (Influence Without Authority)"
    ],
    "decisionFramework": "1. Present evidence calmly: specific impact examples, peer feedback, cross-team comparison data you prepared. 2. Listen to counter-arguments: is there a valid point you're missing? 3. If your case is strong: hold firm with evidence. 4. If their case has merit: gracefully accept and adjust. 5. Either way: communicate outcome to your engineer honestly. 6. Never: throw the committee under the bus.",
    "commonMistakes": "Caving without defending your case. Getting emotional or combative. Not preparing comparison data in advance. Telling your engineer 'I fought for you but they overruled me' (blames the system, undermines trust in the process). Inflating evidence to win the argument.",
    "whatGoodLooksLike": "Strong, evidence-based case that even skeptics find credible. If you win: earned through preparation, not politics. If you lose: you understand why and can explain it honestly to your engineer. Your credibility in the room is intact or strengthened regardless of outcome.",
    "mappingNotes": "Calibration downgrade fight"
  },
  {
    "id": "P-C1-3",
    "slug": "a-cross-team-initiative-is-stalled-because-no-one-owns-it",
    "observableIds": [
      "C1-O2",
      "C5-O7"
    ],
    "capabilityIds": [
      "C1",
      "C5"
    ],
    "title": "A Cross-Team Initiative Is Stalled Because No One Owns It",
    "context": "An important cross-org project has been discussed for months but nobody is driving it. Multiple teams would benefit but each expects the other to lead.",
    "topicsActivated": [
      "Cross-Functional (Dependency Negotiation), Stakeholder Mgmt (Driving Alignment, Political Capital), Decision Making (First Principles)"
    ],
    "decisionFramework": "1. Assess: should your team own this? (Impact on your goals, capacity, strategic value) 2. If yes: volunteer to drive. Write a proposal with scope, timeline, resource needs. 3. Get buy-in from other teams (pre-wire 1:1). 4. Establish DACI. 5. Drive to completion with regular cross-team syncs. 6. If no: identify who should own it and facilitate that conversation.",
    "commonMistakes": "Waiting for someone else to step up (it's been months — they won't). Volunteering without capacity (good intentions, failed execution). Trying to drive without explicit buy-in from participating teams. Not getting DACI clear upfront.",
    "whatGoodLooksLike": "You either own it and drive it to completion, or you facilitate someone else owning it. Cross-team initiative ships. Your role is visible to leadership. Political capital built through execution, not just volunteering. 'Drove [initiative] across [X] teams, delivering [Y] outcome.'",
    "mappingNotes": "Stalled cross-team initiative"
  },
  {
    "id": "P-C14-2",
    "slug": "your-manager-asks-you-to-rate-everyone-meets-expectations",
    "observableIds": [
      "C14-O3",
      "C14-O4"
    ],
    "capabilityIds": [
      "C14"
    ],
    "title": "Your Manager Asks You to Rate Everyone 'Meets Expectations'",
    "context": "Your Director says the org needs to compress ratings this cycle. They want fewer 'Exceeds' ratings. You have 3 engineers who genuinely exceeded.",
    "topicsActivated": [
      "Performance (Ratings Distribution, Delivering Feedback), Stakeholder Mgmt (Managing Up), Decision Making (First Principles)"
    ],
    "decisionFramework": "1. Understand the constraint: is this a hard mandate or guidance? What's driving it? 2. Present your strongest case: 'I can compress 2 of the 3, but this one engineer delivered [X] — here's the evidence.' 3. If Director insists across the board: push back with data one more time, clearly. 4. If overruled: you own the outcome — deliver feedback honestly to your engineers. 5. Never: blame your Director to your team.",
    "commonMistakes": "Silently complying and giving unfair ratings. Openly fighting your Director in calibration (burning political capital). Telling your engineers 'I wanted to give you Exceeds but my boss said no.' Distributing the pain randomly instead of based on evidence.",
    "whatGoodLooksLike": "You advocate clearly with evidence. You compress where reasonable and hold firm where it matters most. If compromised: you deliver honest feedback to affected engineers ('here's what you accomplished, here's the context for the rating, here's your growth path'). Trust preserved in both directions.",
    "mappingNotes": "Forced ratings compression"
  },
  {
    "id": "P-C11-1",
    "slug": "you-need-to-build-a-new-team-from-scratch",
    "observableIds": [
      "C11-O1",
      "C11-O2",
      "C11-O4"
    ],
    "capabilityIds": [
      "C11"
    ],
    "title": "You Need to Build a New Team From Scratch",
    "context": "You've been given headcount to build a new team for a greenfield project. You have 6 months to hire 6 engineers and deliver first milestone.",
    "topicsActivated": [
      "Talent Acquisition (Hiring Loops, Bar, Onboarding), Org Design (Team Structure), Technical Strategy (Vision), Team Health (First 90 Days)"
    ],
    "decisionFramework": "1. First: define team mission, scope, and technical vision (BEFORE hiring). 2. Hire tech lead first (partner on architecture and subsequent hiring). 3. Hiring loop: calibrated, structured, bar raiser. Don't lower bar for speed. 4. Onboard in waves (don't hire all 6 simultaneously). 5. Establish team charter, principles, and rituals from day 1. 6. First milestone should be deliberately achievable — team needs an early win.",
    "commonMistakes": "Hiring all 6 simultaneously (onboarding chaos). Not defining technical direction before hiring (building a team without a mission). Hiring fast at the expense of quality. Not establishing culture intentionally (letting it happen by accident). Setting unrealistic first milestone.",
    "whatGoodLooksLike": "Tech lead hired in month 1, contributing to architecture and hiring. Engineers hired in waves of 2, each wave onboarded before next. Team charter established early. First milestone delivered on time — team has confidence and momentum. By month 6: functioning, cohesive team with clear identity.",
    "mappingNotes": "Build team from scratch"
  },
  {
    "id": "P-C6-3",
    "slug": "one-of-your-ems-is-struggling-director-scenario",
    "observableIds": [
      "C6-O6",
      "C6-O7"
    ],
    "capabilityIds": [
      "C6"
    ],
    "title": "One of Your EMs Is Struggling (Director Scenario)",
    "context": "One of your EMs is underperforming: their team's metrics are declining, skip-level feedback is concerning, and the EM seems overwhelmed.",
    "topicsActivated": [
      "Managing Managers (Coaching EMs, Skip-Levels), Performance (Underperformance), Team Health (First 90 Days for the EM's team)"
    ],
    "decisionFramework": "1. Diagnose: is this a skill gap, will gap, or situation gap? (Can't do it, won't do it, or set up to fail?) 2. If skill: invest in coaching — specific development plan with milestones. 3. If will: direct conversation about expectations and fit. 4. If situation: fix the situation (scope, support, resources). 5. Increase 1:1 cadence. 6. Set clear improvement timeline (60-90 days). 7. If no improvement: you need to make a change.",
    "commonMistakes": "Ignoring it hoping they'll figure it out. Taking over their EM responsibilities (they'll never develop). Replacing them without genuine coaching attempt. Not protecting their team during the transition. Waiting too long to act (the team suffers).",
    "whatGoodLooksLike": "Honest diagnosis shared with EM. Specific coaching plan with clear milestones. Increased support (not micromanagement). If they improve: great — you developed a manager. If not: managed transition with dignity, team protected, replacement plan ready.",
    "mappingNotes": "Struggling EM (Director scenario)"
  },
  {
    "id": "P-C8-2",
    "slug": "production-outage-caused-by-your-teams-deploy",
    "observableIds": [
      "C8-O1",
      "C8-O4"
    ],
    "capabilityIds": [
      "C8"
    ],
    "title": "Production Outage Caused by Your Team's Deploy",
    "context": "Your team deployed a change that caused a major production incident. Customers are affected. Leadership is asking what happened.",
    "topicsActivated": [
      "Operational Risk (Incident Response, Post-Mortems), Stakeholder Mgmt (Delivering Bad News, Status Communication), Engineering Excellence (Release Management, Testing)"
    ],
    "decisionFramework": "1. First: resolve the incident (rollback, mitigation). 2. Communicate: status updates to stakeholders every 30min during incident. 3. Take ownership immediately with leadership: 'our deploy caused this, here's what we're doing.' 4. Post-incident: blameless post-mortem within 48hrs. 5. Action items with owners and deadlines. 6. Prevention: what process/test/check would have caught this? 7. Communicate lessons learned broadly.",
    "commonMistakes": "Pointing fingers at the engineer who deployed. Hiding or minimizing the impact. Not communicating status during the incident. Post-mortem that's actually a blame session. Promising 'it won't happen again' without systemic changes.",
    "whatGoodLooksLike": "Incident resolved quickly through documented process. Ownership taken immediately and clearly. Blameless post-mortem produces systemic improvements (not 'be more careful'). Action items completed within 2 weeks. Similar class of incident prevented going forward. Team trust preserved.",
    "mappingNotes": "Outage caused by your deploy"
  },
  {
    "id": "P-C5-3",
    "slug": "youre-asked-to-take-on-scope-that-doesnt-fit-your-team",
    "observableIds": [
      "C5-O3",
      "C2-O2"
    ],
    "capabilityIds": [
      "C5",
      "C2"
    ],
    "title": "You're Asked to Take on Scope That Doesn't Fit Your Team",
    "context": "Your VP wants your team to own a new area that doesn't align with your team's expertise or mission. It's a political hot potato nobody else wants.",
    "topicsActivated": [
      "Org Design (Cognitive Load, Single-Threaded Ownership), Stakeholder Mgmt (Managing Up, Framing Asks), Decision Making (Saying No, Trade-offs)"
    ],
    "decisionFramework": "1. Understand the real ask: why your team? What's the actual need? 2. Assess honestly: can your team absorb this without degrading current work? What's the cost? 3. If no: propose alternatives (which team should own this? new team needed?). 4. If yes with conditions: 'we can take this if we deprioritize X or get Y headcount.' 5. Never: silently absorb scope that will crush your team.",
    "commonMistakes": "Accepting without understanding the cost. Declining without offering alternatives. Complaining to your team about leadership decisions. Absorbing it and burning out your team to prove you can handle it.",
    "whatGoodLooksLike": "Clear-eyed assessment presented to VP: 'here's what this would cost us' with specific trade-offs. If you accept: explicit agreement on what you're deprioritizing or what resources you're getting. If you decline: alternative proposal that solves the VP's actual problem. Either way: you're seen as thoughtful and solutions-oriented.",
    "mappingNotes": "Asked to take misfit scope"
  },
  {
    "id": "P-C5-4",
    "slug": "a-key-platform-dependency-is-unreliable-and-the-platform-team-wont-prioritize-fixes",
    "observableIds": [
      "C5-O3",
      "C5-O4"
    ],
    "capabilityIds": [
      "C5"
    ],
    "title": "A Key Platform Dependency Is Unreliable and the Platform Team Won't Prioritize Fixes",
    "context": "Your team's reliability is suffering because of an upstream platform dependency. The platform team acknowledges the issue but has higher priorities.",
    "topicsActivated": [
      "Cross-Functional (Dependency Negotiation, Platform Partnership), Technical Strategy (Dependency Management), Operational Risk (Dependency Risk)"
    ],
    "decisionFramework": "1. Quantify impact: how many incidents? Customer impact? Eng hours spent on workarounds? 2. Build relationship with platform EM (understand their constraints). 3. Propose mutual solutions: can you contribute a fix? Can you implement a fallback? 4. If blocked: escalate with data to Director level. 5. Parallel: build resilience against this dependency (circuit breakers, fallbacks, caching).",
    "commonMistakes": "Complaining without data. Escalating without first trying direct partnership. Building a competing solution in secret. Blaming the platform team publicly. Doing nothing and accepting the pain.",
    "whatGoodLooksLike": "Data-driven conversation with platform team. Mutual problem-solving — maybe you contribute the fix, they review and merge. Fallback strategy implemented regardless. If escalation needed: both EMs present jointly to leadership with shared facts and proposed solution. Relationship preserved.",
    "mappingNotes": "Unreliable platform dependency"
  },
  {
    "id": "P-C12-2",
    "slug": "your-team-has-zero-diversity-and-youre-told-to-fix-it",
    "observableIds": [
      "C12-O5",
      "C11-O3"
    ],
    "capabilityIds": [
      "C12",
      "C11"
    ],
    "title": "Your Team Has Zero Diversity and You're Told to Fix It",
    "context": "HR/leadership points out your team is homogeneous. You're asked to 'improve diversity' in your next hires.",
    "topicsActivated": [
      "Talent Acquisition (Sourcing, Hiring Loops), Engineering Culture (Inclusive Environment), Decision Making (First Principles)"
    ],
    "decisionFramework": "1. Audit the full pipeline: where are candidates dropping off? (Sourcing? Screen? Onsite? Offer?) 2. Fix the pipeline, not the outcome: diverse sourcing channels, structured interviews with rubrics, diverse interview panels, bias training. 3. Fix retention too: is your team environment actually inclusive? Would diverse hires thrive? 4. Never: lower the bar or hire for optics. 5. This is a sustained effort, not a one-quarter initiative.",
    "commonMistakes": "Token hiring (one diverse hire into unwelcoming environment — they leave). Lowering the bar (insulting and counterproductive). Treating it as a checkbox exercise. Only fixing sourcing without fixing culture. Delegating entirely to recruiting team.",
    "whatGoodLooksLike": "Pipeline audited and fixed at each stage. Interview process restructured to reduce bias (structured rubrics, diverse panels). Culture assessed honestly — are diverse voices actually heard? Sustained effort over multiple quarters. Diversity improves AND inclusion improves AND bar maintained.",
    "mappingNotes": "Zero diversity fix mandate"
  },
  {
    "id": "P-C7-1",
    "slug": "you-strongly-disagree-with-a-decision-made-above-you",
    "observableIds": [
      "C7-O1",
      "C7-O7"
    ],
    "capabilityIds": [
      "C7"
    ],
    "title": "You Strongly Disagree with a Decision Made Above You",
    "context": "Your Director/VP made a strategic decision you think is wrong. It directly affects your team's direction.",
    "topicsActivated": [
      "Stakeholder Mgmt (Managing Up), Decision Making (Reversible vs Irreversible, First Principles), Team Health (Trust)"
    ],
    "decisionFramework": "1. Understand the full context (you might not have it). Ask questions, not accusations. 2. If you still disagree after understanding context: make your case once, clearly, with data. 3. If overruled: disagree and commit. Execute fully. 4. Never: undermine the decision through passive resistance or complaining to your team. 5. If the decision fails: don't say 'I told you so.' Help fix it.",
    "commonMistakes": "Going along silently (your perspective was valuable and you withheld it). Fighting the same battle repeatedly after the decision is made. Telling your team 'I disagree but we have to do it' (undermines the decision and your leadership above). Sabotaging through half-hearted execution.",
    "whatGoodLooksLike": "You made your case clearly and respectfully. After the decision: you commit fully and execute as if it were your own idea. Your team sees you supporting the direction. If the decision proves wrong: you help course-correct without blame. Your Director remembers you raised the concern constructively.",
    "mappingNotes": "Disagree with decision above you"
  },
  {
    "id": "P-C5-5",
    "slug": "youre-preparing-for-your-own-promotion-to-director",
    "observableIds": [
      "C5-O5",
      "C5-O6",
      "C14-O2"
    ],
    "capabilityIds": [
      "C5",
      "C14"
    ],
    "title": "You're Preparing for Your Own Promotion to Director",
    "context": "You've been a strong EM for 2+ years and want to make the jump to Director. What do you actually need to demonstrate?",
    "topicsActivated": [
      "Performance (Promo Packets, Career Growth), Stakeholder Mgmt (Sponsor Relationships, Executive Communication), Managing Managers (all principles), Org Design (all principles)"
    ],
    "decisionFramework": "1. Map current scope to Director-level rubric — identify gaps honestly. 2. Build evidence of Director-level work: cross-team impact, org-level strategy, developing other managers. 3. Get a sponsor (not just a mentor) at VP+ level. 4. Demonstrate you can operate at Director altitude while still delivering as EM. 5. Your promo case should be obvious before you submit it.",
    "commonMistakes": "Asking for the title without doing the job. Focusing on managing your team well (necessary but not sufficient — Directors operate across teams). Not building sponsor relationships. Waiting for your manager to nominate you instead of driving your own career. Neglecting your current team while chasing Director scope.",
    "whatGoodLooksLike": "You've been operating at Director level for 6+ months before the promo discussion. Cross-team impact is documented. You've developed at least one future EM. You have a sponsor who advocates for you. Your current team continues to thrive. The promo feels like recognition of reality, not aspiration.",
    "mappingNotes": "Preparing own Director promotion"
  },
  {
    "id": "P-C9-1",
    "slug": "dora-metrics-show-decline-but-team-feels-fine",
    "observableIds": [
      "C9-O1",
      "C9-O3"
    ],
    "capabilityIds": [
      "C9"
    ],
    "title": "DORA Metrics Show Decline But Team Feels Fine",
    "context": "Your DORA metrics have been trending down for 2 quarters — deploy frequency dropped 40%, lead time increased 3x. But team morale is fine and nobody is complaining. Your VP saw the dashboard and is asking questions.",
    "topicsActivated": [
      "Metrics Measurement (DORA analysis), Activity Metrics (diagnostic vs punitive), Stakeholder Mgmt (framing to VP)"
    ],
    "decisionFramework": "1. Investigate root cause: is it real degradation or measurement artifact (team grew, monolith split, deploy definition changed)? 2. Correlate with outcomes: are incidents up? Is velocity actually down? Customer impact? 3. If real: identify bottleneck (CI pipeline? review queue? test suite? environment contention?). 4. If artifact: fix the measurement, communicate context to VP. 5. Either way: present findings with context, not just numbers. 6. Create improvement plan with team ownership, not top-down targets.",
    "commonMistakes": "Setting DORA targets as team KPIs (Goodhart's Law). Gaming deploy frequency by splitting deploys. Presenting raw numbers to VP without context. Blaming the team instead of investigating systemic causes. Ignoring the signal because \"team feels fine.\"",
    "whatGoodLooksLike": "Root cause identified within 1 week. VP gets context-rich update (not just \"we'll fix it\"). If real: targeted improvement with measurable progress within 1 quarter. If artifact: measurement corrected, team educated on what metrics actually mean. Metrics used as shared investigation tool, never punishment.",
    "mappingNotes": "DORA decline investigation scenario — metrics as diagnostic"
  },
  {
    "id": "P-C10-1",
    "slug": "budget-cut-lose-20-headcount-keep-critical-deliverables",
    "observableIds": [
      "C10-O1",
      "C10-O2",
      "C10-O5"
    ],
    "capabilityIds": [
      "C10"
    ],
    "title": "Budget Cut: Lose 20% Headcount, Keep Critical Deliverables",
    "context": "Company announces 20% headcount reduction. You have 25 engineers across 4 teams. You need to identify 5 positions to cut while maintaining delivery on your top-3 commitments. You have 2 weeks before the announcement.",
    "topicsActivated": [
      "Resource Allocation (headcount planning), Strategic Prioritization (ruthless triage), People Management (layoff execution), Stakeholder Mgmt (managing up during crisis)"
    ],
    "decisionFramework": "1. Map all current work to business impact tiers: critical (revenue/compliance), important (strategic), nice-to-have (quality-of-life). 2. Identify what STOPS — be explicit, write it down. 3. Assess team composition: performance, criticality of knowledge, single points of failure. 4. Optimize for org survival: protect critical path, maintain minimum viable team per area. 5. Prepare talking points for affected individuals (with your HR partner). 6. Tell affected people FIRST, with humanity. 7. Re-plan roadmap with remaining team within 1 week. 8. Communicate revised plan to stakeholders within 2 weeks.",
    "commonMistakes": "Spreading cuts evenly across teams (peanut butter approach). Cutting based solely on performance ratings. Not communicating what stops. Protecting pet projects over business-critical work. Delaying the conversation with affected people. Not re-planning the roadmap after cuts.",
    "whatGoodLooksLike": "Clear-eyed impact analysis delivered to leadership within days. Affected individuals told with dignity and support. Remaining team has revised, achievable roadmap within 1 week. Stakeholders know what's changing. Zero regrettable attrition from survivors. Team productive within 3-4 weeks.",
    "mappingNotes": "Headcount reduction scenario — resource allocation under constraint"
  },
  {
    "id": "P-C13-1",
    "slug": "security-audit-finding-critical-vulnerability-in-production",
    "observableIds": [
      "C13-O1",
      "C13-O2",
      "C13-O4"
    ],
    "capabilityIds": [
      "C13"
    ],
    "title": "Security Audit Finding: Critical Vulnerability in Production",
    "context": "Internal security audit found a critical vulnerability (e.g., unencrypted PII in logs, open S3 bucket, SQL injection vector) in your team's production service. Security team has given you a 72-hour remediation window. Your team is mid-sprint on a high-priority feature launch.",
    "topicsActivated": [
      "Security Compliance (vulnerability SLAs), Operational Risk (incident-adjacent), Stakeholder Mgmt (communicating priority shift), Strategic Prioritization (competing demands)"
    ],
    "decisionFramework": "1. Assess severity and blast radius immediately — what data is exposed, who is affected, what's the regulatory implication? 2. Communicate to your manager and stakeholders SAME DAY: feature timeline is shifting. 3. Assign your best engineer to the fix — this is not junior work. 4. Implement fix + write regression test + add to automated scanning to prevent recurrence. 5. Document root cause: how did this get to production? What process failed? 6. Close the loop with security team within SLA. 7. Post-fix: update threat model, add to security review checklist, share learning broadly.",
    "commonMistakes": "Treating it as security team's problem. Trying to fix it quietly without telling stakeholders about the feature delay. Assigning it to whoever is \"free\" instead of your most capable engineer. Fixing the symptom without addressing how it got to production. Not communicating the feature timeline impact upward.",
    "whatGoodLooksLike": "Vulnerability patched within 72hrs. Root cause documented. Process gap identified and closed (new automated check, updated review checklist). Stakeholders informed proactively about feature delay. Security team relationship strengthened, not adversarial. Team learns from it — similar vulnerability never recurs.",
    "mappingNotes": "Critical security finding response scenario"
  },
  {
    "id": "P-C3-2",
    "slug": "your-teams-tech-stack-becomes-deprecated-company-wide",
    "observableIds": ["C3-O4", "C3-O6"],
    "capabilityIds": ["C3"],
    "title": "Your Team's Tech Stack Becomes Deprecated Company-Wide",
    "context": "Platform team announces your primary framework/language is sunset. Migration timeline is 18 months. You have 100K lines of code in the deprecated stack, active feature development in flight, and no one on your team has deep experience with the target stack.",
    "topicsActivated": [
      "Technical Strategy (Migration Planning, Tech Debt), Team Health (Skill Development, Morale), Stakeholder Mgmt (Timeline Negotiation), Engineering Excellence (Incremental Migration)"
    ],
    "decisionFramework": "1. Assess blast radius: how much of your codebase is affected? What's the dependency graph? Which services are most critical? 2. Evaluate team readiness: who has experience with the target stack? What training is needed? Budget learning time explicitly. 3. Negotiate timeline: 18 months may be unrealistic for 100K LOC — present data-driven counter-proposal if needed. 4. Choose migration strategy: strangler fig (incremental) vs. big bang rewrite. Almost always choose strangler fig. 5. Create migration backlog: prioritize by risk (most critical services first) and coupling (least coupled first for early wins). 6. Run feature development and migration in parallel — do NOT freeze features for 18 months. 7. Establish migration metrics: % migrated, velocity per sprint, blockers. Report weekly to platform team and leadership. 8. Negotiate for dedicated migration capacity (at least 30% of team bandwidth).",
    "commonMistakes": "Attempting a big-bang rewrite (historically fails at 100K+ LOC scale). Freezing all feature work to focus on migration (business won't tolerate it). Not investing in team upskilling early (migration stalls in month 3 when nobody knows the new stack). Treating migration as purely technical without communicating business impact upward. Waiting until month 12 to flag that the timeline is unrealistic. Not negotiating for dedicated capacity — trying to squeeze migration into 'spare time.'",
    "whatGoodLooksLike": "Strangler fig migration plan published within 2 weeks of announcement. Team upskilling started immediately (pairing sessions, training budget, internal tech talks). First service migrated within 6 weeks as proof of concept. Feature development continues at 70% capacity during migration. Weekly migration metrics visible to all stakeholders. Timeline renegotiated early if needed — with data, not excuses. Team emerges with new skills and stronger architecture. Zero production incidents caused by the migration itself.",
    "mappingNotes": "Tech stack deprecation and large-scale migration planning"
  },
  {
    "id": "P-C1-4",
    "slug": "merging-two-teams-after-acquisition-re-org",
    "observableIds": ["C1-O3", "C1-O14"],
    "capabilityIds": ["C1"],
    "title": "Merging Two Teams After Acquisition/Re-org",
    "context": "Company acquired a startup. You're responsible for merging their 8-person team with your 12-person team. Different tech stacks (they use Python/Django, you use Java/Spring), different cultures (startup speed vs. enterprise process), different processes (they have no sprint planning, you run 2-week sprints with full ceremonies). Some role overlap exists. Both teams are anxious about who stays, who leads, and what changes.",
    "topicsActivated": [
      "Org Design (Team Mergers, Culture Integration), Team Health (Psychological Safety, Trust Building), Technical Strategy (Stack Consolidation), Stakeholder Mgmt (Managing Up, Managing Expectations)"
    ],
    "decisionFramework": "1. Week 1: Meet every person on the acquired team individually — understand their role, concerns, what they value about their current culture. Listen more than you talk. 2. Week 2: Identify overlaps and complementary skills. Map who owns what. Do NOT make org changes yet. 3. Weeks 3-4: Establish shared rituals — joint standup, shared Slack channel, cross-team pairing sessions. Let cultures cross-pollinate before forcing convergence. 4. Month 2: Make org structure decisions — be transparent about rationale. If roles overlap, decide based on skill and contribution, not 'which team they came from.' 5. Month 2-3: Consolidate processes gradually — take the best of both. Don't force the acquired team to adopt all your processes wholesale. 6. Months 3-6: Tech stack convergence plan — decide on target stack with input from both teams. This is a multi-quarter effort. 7. Throughout: over-communicate. Ambiguity breeds anxiety and attrition.",
    "commonMistakes": "Treating the acquired team as subordinate ('you're joining us, adopt our ways'). Making org changes in week 1 before understanding the people. Forcing immediate tech stack convergence (creates resentment and risk). Ignoring cultural differences and expecting instant alignment. Losing key acquired talent because they feel undervalued. Not addressing role overlap directly — letting it fester into political infighting. Assuming your processes are better because you're the acquirer.",
    "whatGoodLooksLike": "Every acquired team member feels heard within the first 2 weeks. Org structure decisions made transparently with clear rationale. Best practices adopted from BOTH teams (acquired team sees their ideas valued). Zero regrettable attrition from either team in the first 6 months. Shared team identity emerges organically. Tech stack convergence plan is data-driven and has buy-in from engineers on both sides. By month 6: it's one team, not 'us and them.'",
    "mappingNotes": "Post-acquisition team merger and cultural integration"
  },
  {
    "id": "P-C8-3",
    "slug": "managing-through-a-major-security-incident-data-breach",
    "observableIds": ["C8-O1", "C8-O2", "C13-O1", "C13-O2"],
    "capabilityIds": ["C8", "C13"],
    "title": "Managing Through a Major Security Incident (Data Breach)",
    "context": "Security team discovers unauthorized data access to your team's service. Customer PII (names, emails, hashed passwords) may be compromised. The scope is unclear — could be hundreds or millions of records. Legal, PR, and the exec team are involved. Your team owns the affected service. The incident is already escalated to the CEO. Clock is ticking on regulatory notification requirements (72 hours under GDPR).",
    "topicsActivated": [
      "Operational Risk (Incident Command, War Room), Security Compliance (Breach Response, Regulatory Notification), Stakeholder Mgmt (Exec Communication, Cross-Functional Coordination), Team Health (Crisis Management, Protecting Engineers)"
    ],
    "decisionFramework": "1. Immediate (Hour 0-4): Establish incident command structure. Your role is EM-level incident commander for the technical response. Contain the breach — revoke compromised credentials, patch the vulnerability, preserve forensic evidence (do NOT destroy logs). 2. Hour 4-12: Scope the impact — how many records, what data types, what time period. Work with security team on forensic analysis. Provide regular updates to exec war room (every 2 hours). 3. Hour 12-48: Support legal team with technical facts for regulatory notification. Prepare customer-facing technical explanation (work with PR). Continue forensic analysis — understand attack vector completely. 4. Day 2-7: Implement permanent fix (not just patch). Conduct thorough security review of adjacent systems. Begin post-incident review. 5. Week 2-4: Full post-mortem with systemic improvements. Security architecture review. Team well-being check — breaches are extremely stressful. 6. Throughout: protect your engineers from exec pressure. They need to focus on the technical response, not fielding questions from 15 VPs.",
    "commonMistakes": "Destroying evidence in the rush to fix (deleting logs, wiping servers). Downplaying severity to leadership ('it's probably not that bad'). Letting every executive directly ping your engineers for status. Not involving legal immediately (regulatory clock is ticking). Promising a root cause before forensics are complete. Blaming the engineer who wrote the vulnerable code. Not checking on your team's well-being during and after the crisis. Treating the post-mortem as optional because 'we already fixed it.'",
    "whatGoodLooksLike": "Breach contained within hours, not days. Forensic evidence preserved from minute one. Exec team gets regular, honest updates (not optimistic guesses). Legal has what they need for regulatory notification within 72 hours. Customer communication is transparent and accurate. Root cause identified and systemic fix implemented (not just a patch). Security review of adjacent systems completed. Post-mortem produces architectural improvements that prevent this class of vulnerability. Your team is recognized for their response, not blamed for the breach. No one burns out from the crisis.",
    "mappingNotes": "Major security incident and data breach response"
  },
  {
    "id": "P-C6-4",
    "slug": "your-skip-level-reports-are-unhappy-with-their-em",
    "observableIds": ["C6-O6", "C6-O11"],
    "capabilityIds": ["C6"],
    "title": "Your Skip-Level Reports Are Unhappy With Their EM",
    "context": "In skip-level 1:1s, multiple engineers (3 out of 7) express frustration with their EM. Recurring themes: lack of career development conversations, micromanagement on technical decisions, poor communication about team priorities, and feeling unheard. The EM has been in role for 18 months and was promoted from within. Their self-assessment is that things are going well.",
    "topicsActivated": [
      "Managing Managers (Skip-Level Feedback, Coaching EMs), Performance (Underperformance, Feedback Delivery), Team Health (Psychological Safety, Trust)"
    ],
    "decisionFramework": "1. Validate the signal: are 3 engineers saying the same thing independently, or is this a clique? Are the themes consistent? Is there performance data that corroborates (retention risk, engagement survey scores, velocity trends)? 2. Do NOT relay skip-level feedback verbatim to the EM — that destroys skip-level trust. Instead, synthesize themes: 'I'm hearing signals that career development and communication could be stronger on your team.' 3. Have a direct coaching conversation with the EM: share observed themes (not attributing to specific people), ask for their perspective, listen for self-awareness. 4. Co-create a development plan: specific actions on career conversations (monthly with each report), delegation framework (decide which technical decisions they truly need to own vs. delegate), communication cadence (weekly team priorities update). 5. Set a 60-day checkpoint. Increase your own 1:1 cadence with this EM to weekly. 6. Follow up with skip-level reports in 30 and 60 days — is it improving? 7. If no improvement after 60 days with genuine coaching: this may be a performance conversation, not a coaching conversation.",
    "commonMistakes": "Sharing skip-level feedback directly with attribution ('Alex said you're micromanaging') — destroys skip-level trust permanently. Ignoring the signal because the EM's self-assessment is positive. Taking over the EM's responsibilities instead of coaching them. Moving engineers to other teams without addressing the root cause (the EM's behavior). Giving vague feedback ('you need to communicate better') without specific, actionable guidance. Waiting too long — 3 unhappy engineers become 5, then attrition starts.",
    "whatGoodLooksLike": "EM receives synthesized, actionable feedback without knowing who said what. Development plan has specific, measurable actions (not 'be better at communication'). EM shows genuine self-awareness and desire to improve. Skip-level reports notice improvement within 30-60 days. If EM improves: you developed a manager and built trust in both directions. If EM doesn't improve: you have documented pattern and can make a fair decision. Either way: skip-level reports trust that their feedback was heard and acted upon.",
    "mappingNotes": "Skip-level dissatisfaction with EM — coaching and intervention"
  },
  {
    "id": "P-C10-2",
    "slug": "budget-is-frozen-but-commitments-remain",
    "observableIds": ["C10-O2", "C10-O5", "C2-O2"],
    "capabilityIds": ["C10", "C2"],
    "title": "Budget Is Frozen But Commitments Remain",
    "context": "Mid-year budget freeze announced. No new hires (you had 4 open reqs), no new vendor contracts, limited travel and conference budget. But your Q3-Q4 commitments haven't been adjusted. Leadership expects delivery on the original roadmap. Your team is already at capacity, and two of the open reqs were for a critical new initiative that starts next quarter.",
    "topicsActivated": [
      "Resource Allocation (Constraint-Based Planning), Strategic Prioritization (Ruthless Triage), Stakeholder Mgmt (Managing Up, Resetting Expectations), Delivery Management (Doing More With Less)"
    ],
    "decisionFramework": "1. Immediate: map every commitment to required capacity (people-weeks). Total it up. Compare to available capacity without the 4 missing hires. Quantify the gap precisely (e.g., 'we're 35% short of committed capacity'). 2. Tier your commitments: Tier 1 (must deliver — revenue, contractual, compliance), Tier 2 (should deliver — strategic, high-value), Tier 3 (could deliver — quality-of-life, nice-to-have). 3. Present the gap to leadership with options: (A) Cut Tier 3 entirely and reduce Tier 2 scope — deliver Tier 1 on time. (B) Delay Tier 2 to Q1 next year — deliver Tier 1 + reduced Tier 3. (C) Deliver everything with explicit quality/reliability trade-offs (not recommended). 4. Force the prioritization decision upward — do not silently absorb an impossible scope. 5. Communicate to team: 'here's what changed, here's what we're focusing on, here's what we're NOT doing.' 6. Explore creative solutions: internal transfers, contractor budget (if not frozen), automation of manual work, scope reduction on individual projects.",
    "commonMistakes": "Silently accepting the original commitments and burning out your team trying to deliver. Not quantifying the capacity gap with data (just saying 'we can't do it all'). Spreading the team thin across everything instead of cutting scope decisively. Waiting until Q3 delivery misses to raise the alarm. Not exploring creative alternatives (internal mobility, automation, scope negotiation). Complaining to your team about leadership instead of actively managing upward.",
    "whatGoodLooksLike": "Capacity gap quantified and presented to leadership within 1 week of freeze announcement. Prioritization framework forces explicit trade-off decisions at the leadership level. Team has a clear, achievable plan — they know what they're doing and what they're NOT doing. Creative alternatives explored and implemented where possible. Tier 1 commitments delivered on time. Leadership sees you as someone who manages constraints proactively, not someone who either over-promises or just complains. Team morale stays stable because expectations are realistic.",
    "mappingNotes": "Budget freeze with unchanged commitments — constraint-based planning"
  },
  {
    "id": "P-C10-3",
    "slug": "leading-a-cost-optimization-initiative-finops",
    "observableIds": ["C10-O3", "C3-O9"],
    "capabilityIds": ["C10", "C3"],
    "title": "Leading a Cost Optimization Initiative (FinOps)",
    "context": "CFO mandates 30% cloud cost reduction across engineering. You're asked to lead the initiative for your org (4 teams, ~40 engineers). Current monthly spend is $2M across AWS services. No one has a clear picture of what's driving costs. Teams have never been held accountable for infrastructure spend. Finance wants a plan in 2 weeks and results within the quarter.",
    "topicsActivated": [
      "Financial Management (Cloud Cost Optimization, FinOps), Technical Strategy (Infrastructure Efficiency), Cross-Functional Partnership (Finance/Engineering Alignment), Stakeholder Mgmt (Driving Org-Wide Initiative)"
    ],
    "decisionFramework": "1. Week 1 — Visibility: Get cost breakdown by team, service, and environment. Tag everything. Identify top 10 cost drivers (usually 80/20 rule applies — a few services drive most spend). Distinguish production from non-production costs. 2. Week 2 — Quick wins: Identify low-hanging fruit (unused resources, oversized instances, non-prod environments running 24/7, unattached EBS volumes, idle load balancers). These often yield 10-15% savings with minimal effort. 3. Week 2 — Plan: Present tiered savings plan: Tier 1 (quick wins, 10-15%, 2 weeks), Tier 2 (right-sizing and reserved instances, 10-15%, 6-8 weeks), Tier 3 (architectural changes — caching, serverless migration, data tiering, 5-10%, 1-2 quarters). 4. Execution: Assign cost owners per team. Create cost dashboards visible to all engineers. Set up weekly cost review cadence. Implement automated alerts for spend anomalies. 5. Sustainability: Bake cost awareness into architecture reviews and PR reviews. Make cloud cost a standing item in team retrospectives. Celebrate wins publicly. 6. Report to CFO monthly with progress against target, broken down by initiative.",
    "commonMistakes": "Promising 30% savings purely from quick wins (architectural changes are needed for the last 10-15%). Not tagging resources properly (you can't optimize what you can't measure). Making engineers feel punished for using cloud resources (kills innovation). Cutting non-prod environments that teams actually need for testing. Not setting up sustainable practices (costs creep back within 6 months). Treating it as a one-time project instead of an ongoing discipline. Over-optimizing and causing production reliability issues (saving $50K/month but causing outages that cost more).",
    "whatGoodLooksLike": "Full cost visibility achieved within 2 weeks. Quick wins (10-15%) delivered within first month. 30% target achieved within the quarter through combination of quick wins, right-sizing, and architectural improvements. Cost dashboards used by engineers proactively (not just finance). FinOps practices embedded in team culture — cost is considered in architecture decisions going forward. No production reliability degradation. CFO sees engineering as a partner in financial discipline, not a cost center to be squeezed.",
    "mappingNotes": "Cloud cost optimization and FinOps leadership"
  },
  {
    "id": "P-C11-2",
    "slug": "managing-through-a-hiring-freeze",
    "observableIds": ["C11-O1", "C11-O5", "C6-O4"],
    "capabilityIds": ["C11", "C6"],
    "title": "Managing Through a Hiring Freeze",
    "context": "6-month hiring freeze announced company-wide. You have 3 open reqs mid-pipeline — one candidate just passed the onsite, another is in final round, and a third is at phone screen stage. Your team of 9 is already stretched across 3 projects. Two senior engineers are showing signs of burnout. One mid-level engineer recently mentioned they've been getting recruiter outreach. Attrition risk is real and you can't backfill.",
    "topicsActivated": [
      "Talent Acquisition (Pipeline Management During Freeze), Team Health (Retention, Burnout Prevention), Performance (Capacity Planning), Stakeholder Mgmt (Priority Negotiation)"
    ],
    "decisionFramework": "1. Candidates in pipeline: Fight for exceptions for the candidate who passed onsite — they're the hardest to re-recruit later. Present the cost of losing them (recruiting fees, ramp time, offer expiration). For earlier-stage candidates: communicate honestly and keep them warm if possible. 2. Scope reduction: Immediately re-prioritize. With 9 people instead of planned 12, you cannot run 3 full projects. Present leadership with options: (A) 2 projects at full speed + 1 paused, (B) 3 projects at reduced scope, (C) rank order and leadership decides. 3. Retention: Individual conversations with each team member within 1 week. Understand their concerns. Invest in what you CAN offer — stretch assignments, learning opportunities, conference talks, visibility projects, flexible work arrangements. 4. Burnout mitigation: Reduce meeting load, protect focus time, be explicit about what's NOT getting done. No hero culture. 5. Internal mobility: Can you borrow people from teams with lower priority work? Propose temporary reallocation. 6. Plan for freeze end: Keep job descriptions updated, maintain recruiter relationships, have a priority order for reqs when hiring resumes.",
    "commonMistakes": "Accepting the freeze without fighting for in-pipeline candidates (especially post-onsite — you'll never get them back). Not adjusting scope to match reduced team (expecting 9 people to do the work of 12). Ignoring retention risk because 'where would they go in this market?' (good engineers always have options). Canceling all development investment (training, conferences, hackathons) — this is exactly when you need retention tools most. Burning out your best people by giving them the extra work. Not planning for freeze end — scrambling when hiring reopens wastes months.",
    "whatGoodLooksLike": "Exception secured for post-onsite candidate (or at least a genuine attempt with VP-level advocacy). Scope explicitly reduced and communicated to stakeholders — no silent over-commitment. Every team member has had a 1:1 within the first week addressing their concerns and growth path. Burnout signals monitored actively — workload redistributed, low-priority work paused. Zero regrettable attrition during freeze. When hiring reopens: reqs are ready, pipeline is warm, team hits the ground running.",
    "mappingNotes": "Hiring freeze management and retention during constraints"
  },
  {
    "id": "P-C3-3",
    "slug": "your-product-is-being-sunset-deprecated",
    "observableIds": ["C3-O6", "C1-O15", "C7-O4"],
    "capabilityIds": ["C3", "C1", "C7"],
    "title": "Your Product Is Being Sunset/Deprecated",
    "context": "Leadership decides to sunset your team's product — a service with 50K active users. Revenue doesn't justify continued investment. Users need to be migrated to an alternative (internal or third-party). Timeline is 9 months. Your team of 10 engineers built this product over 3 years. They're anxious about their futures — will they be laid off, reassigned, or forgotten?",
    "topicsActivated": [
      "Technical Strategy (Deprecation Planning, User Migration), Org Design (Team Dissolution/Reassignment), Team Health (Morale, Career Anxiety), Stakeholder Mgmt (Communicating Difficult Decisions), Change Management (Product Lifecycle End)"
    ],
    "decisionFramework": "1. People first (Day 1-3): Before talking about migration plans, address your team's concerns. Be transparent about what you know and don't know. Commit to advocating for every team member's next role. If you have guarantees about no layoffs, say so. If you don't, be honest about the uncertainty. 2. Migration planning (Week 1-2): Assess user segmentation — which users migrate to what alternative? Create migration tiers: self-serve users (automated migration tools), mid-tier (guided migration with docs), enterprise/high-touch (white-glove migration support). 3. Communication plan (Week 2): Draft user communication in partnership with PM and marketing. Give users maximum notice. Provide clear timelines, migration guides, and support channels. 4. Technical execution (Month 1-8): Build migration tooling, maintain product stability during wind-down (no new features, but fix critical bugs and security issues), decommission infrastructure in phases. 5. Team placement (Month 1-6): Work with your manager and HR to identify landing spots for every team member. Match skills and interests to open roles. Start conversations early — don't wait until month 8. 6. Knowledge transfer (Month 6-9): Document institutional knowledge, transfer ownership of any shared components, archive code and documentation. 7. Sunset (Month 9): Final user cutover, infrastructure decommission, retrospective on the product lifecycle.",
    "commonMistakes": "Not addressing team anxiety immediately (people start job searching externally on Day 1 if they feel uncertain). Treating migration as an afterthought (50K users migrating poorly creates customer support nightmares and brand damage). Letting product quality degrade during wind-down (users still depend on it until they're migrated). Not fighting for your team members' placement (they remember who advocated for them). Waiting until month 7 to start placing people (best roles are taken). Pretending the product was a failure (it served users for 3 years — honor that). Not doing a retrospective (valuable lessons about product-market fit, technical decisions, and lifecycle management).",
    "whatGoodLooksLike": "Every team member knows their next role by month 6 — zero involuntary departures. User migration is smooth: 90%+ migrated with minimal support tickets. Product quality maintained until final cutover — no embarrassing outages during sunset. User communication is transparent and empathetic — NPS impact minimized. Team morale stays functional throughout (it won't be great, but it stays professional). Retrospective captures genuine lessons learned. Team members look back and say 'that was hard, but it was handled well.'",
    "mappingNotes": "Product sunset, user migration, and team reassignment"
  }
]